---
kind: method
id: M:Autodesk.Revit.DB.WorksharingDisplaySettings.GetRemovedUsers
source: html/1a79abbd-a072-2e11-1405-06252915fd9e.htm
---
# Autodesk.Revit.DB.WorksharingDisplaySettings.GetRemovedUsers Method

Returns the set of users who have been explicitly removed from the settings.

## Syntax (C#)
```csharp
public ICollection<string> GetRemovedUsers()
```

## Returns
Users who have been explicitly removed from the list.